<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>4.3. Social Movie Database</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v2.0.0" /><link rel="up" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="prev" href="cypherdoc-movie-database.html" title="4.2. Movie Database" /><link rel="next" href="cypherdoc-finding-paths.html" title="4.4. Finding Paths" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 5. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 6. Languages" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 7. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 8. Syntax" /><link rel="chapter" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="chapter" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 12. Functions" /><link rel="chapter" href="cypher-schema.html" title="Chapter 13. Schema" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 14. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 15. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 16. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 17. Data Import" /><link rel="chapter" href="graph-algo.html" title="Chapter 18. Graph Algorithms" /><link rel="chapter" href="rest-api.html" title="Chapter 19. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 20. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 21. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 22. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 23. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 24. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 25. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 26. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 27. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 28. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 29. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 30. Contributing to Neo4j" /><link rel="part" href="advanced-usage.html" title="Part VIII. Advanced Usage" /><link rel="chapter" href="server-extending.html" title="Chapter 31. Extending the Neo4j Server" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 32. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 33. The Traversal Framework" /><link rel="chapter" href="indexing.html" title="Chapter 34. Legacy Indexing" /><link rel="chapter" href="batchinsert.html" title="Chapter 35. Batch Insertion" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-installer" /><link rel="refentry" href="re03.html" title="neo4j-shell" /><link rel="refentry" href="re04.html" title="neo4j-backup" /><link rel="refentry" href="re05.html" title="neo4j-arbiter" /><link rel="copyright" href="ln-idp218960.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="tutorials.html">Tutorials</a></span> &gt; <span class="breadcrumb-link"><a href="tutorials-cypher.html">Getting started with Cypher</a></span> &gt; <span class="breadcrumb-node">Social Movie Database</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="cypherdoc-movie-database.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="cypherdoc-finding-paths.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="cypherdoc-social-movie-database"></a>4.3. Social Movie Database</h2></div></div></div><p>Our example graph consists of movies with title and year and actors with a name.
Actors have <code class="literal">ACTS_IN</code> relationships to movies, which represents the role they played.
This relationship also has a role attribute.</p><p>So far, we queried the movie data; now let’s <span class="emphasis"><em>update the graph</em></span> too.</p><pre class="programlisting brush: cypher">CREATE (matrix1:Movie { title : 'The Matrix', year : '1999-03-31' })
CREATE (matrix2:Movie { title : 'The Matrix Reloaded', year : '2003-05-07' })
CREATE (matrix3:Movie { title : 'The Matrix Revolutions', year : '2003-10-27' })
CREATE (keanu:Actor { name:'Keanu Reeves' })
CREATE (laurence:Actor { name:'Laurence Fishburne' })
CREATE (carrieanne:Actor { name:'Carrie-Anne Moss' })
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix1)
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix2)
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix3)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix1)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix2)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix3)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix1)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix2)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix3)</pre><p class="cypherdoc-console"></p><p>We will add ourselves, friends and movie ratings.</p><p>Here’s how to add a node for yourself and return it, let’s say your name is “Me”:</p><pre class="programlisting brush: cypher">CREATE (me:User { name: "Me" })
RETURN me;</pre><div class="queryresult table"><table cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">me</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Nodes created: 1
</th></tr><tr><th align="left" valign="top">Properties set: 1
</th></tr><tr><th align="left" valign="top">Labels added: 1</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[6]{name:"Me"}</code></p></td></tr></tbody></table></div><p>Let’s check if the node is there:</p><pre class="programlisting brush: cypher">MATCH (me:User { name: "Me" })
RETURN me.name;</pre><p>Add a movie rating:</p><pre class="programlisting brush: cypher">MATCH (me:User { name: "Me" }),(movie:Movie { title: "The Matrix" })
CREATE (me)-[:RATED { stars : 5, comment : "I love that movie!" }]-&gt;(movie);</pre><p>Which movies did I rate?</p><pre class="programlisting brush: cypher">MATCH (me:User { name: "Me" }),(me)-[rating:RATED]-&gt;(movie)
RETURN movie.title, rating.stars, rating.comment;</pre><div class="queryresult table"><table cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /><col class="col3" /></colgroup><thead><tr><th align="left" valign="top">movie.title</th><th align="left" valign="top">rating.stars</th><th align="left" valign="top">rating.comment</th></tr></thead><tfoot><tr><th colspan="3" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">"The Matrix"</code></p></td><td align="left" valign="top"><p><code class="literal">5</code></p></td><td align="left" valign="top"><p><code class="literal">"I love that movie!"</code></p></td></tr></tbody></table></div><p>We need a friend!</p><pre class="programlisting brush: cypher">CREATE (friend:User { name: "A Friend" })
RETURN friend;</pre><p>Add our friendship idempotently, so we can re-run the query without adding it several times.
We return the relationship to check that it has not been created several times.</p><pre class="programlisting brush: cypher">MATCH (me:User { name: "Me" }),(friend:User { name: "A Friend" })
CREATE UNIQUE (me)-[friendship:FRIEND]-&gt;(friend)
RETURN friendship;</pre><p>You can rerun the query, see that it doesn’t change anything the second time!</p><p>Let’s update our friendship with a <code class="literal">since</code> property:</p><pre class="programlisting brush: cypher">MATCH (me:User { name: "Me" })-[friendship:FRIEND]-&gt;(friend:User { name: "A Friend" })
SET friendship.since='forever'
RETURN friendship;</pre><p>Let’s pretend us being our friend and wanting to see which movies our friends have rated.</p><pre class="programlisting brush: cypher">MATCH (me:User { name: "A Friend" })-[:FRIEND]-(friend)-[rating:RATED]-&gt;(movie)
RETURN movie.title, avg(rating.stars) AS stars, collect(rating.comment) AS comments, count(*);</pre><div class="queryresult table"><table cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /><col class="col3" /><col class="col4" /></colgroup><thead><tr><th align="left" valign="top">movie.title</th><th align="left" valign="top">stars</th><th align="left" valign="top">comments</th><th align="left" valign="top">count(*)</th></tr></thead><tfoot><tr><th colspan="4" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">"The Matrix"</code></p></td><td align="left" valign="top"><p><code class="literal">5.0</code></p></td><td align="left" valign="top"><p><code class="literal">["I love that movie!"]</code></p></td><td align="left" valign="top"><p><code class="literal">1</code></p></td></tr></tbody></table></div><p>That’s too little data, let’s add some more friends and friendships.</p><pre class="programlisting brush: cypher">MATCH (me:User { name: "Me" })
FOREACH (i IN range(1,10)| CREATE (friend:User { name: "Friend " + i }),(me)-[:FRIEND]-&gt;(friend));</pre><p>Show all our friends:</p><pre class="programlisting brush: cypher">MATCH (me:User { name: "Me" })-[r:FRIEND]-&gt;(friend)
RETURN type(r) AS friendship, friend.name;</pre><div class="queryresult table"><table cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">friendship</th><th align="left" valign="top">friend.name</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">11 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"A Friend"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"Friend 1"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"Friend 2"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"Friend 3"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"Friend 4"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"Friend 5"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"Friend 6"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"Friend 7"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"Friend 8"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"Friend 9"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"FRIEND"</code></p></td><td align="left" valign="top"><p><code class="literal">"Friend 10"</code></p></td></tr></tbody></table></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp218960.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2013 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="cypherdoc-movie-database.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="tutorials-cypher.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="cypherdoc-finding-paths.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
