<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>4.2. Movie Database</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v2.0.0" /><link rel="up" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="prev" href="cypherdoc-create-nodes-and-relationships.html" title="4.1. Create nodes and relationships" /><link rel="next" href="cypherdoc-social-movie-database.html" title="4.3. Social Movie Database" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 5. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 6. Languages" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 7. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 8. Syntax" /><link rel="chapter" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="chapter" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 12. Functions" /><link rel="chapter" href="cypher-schema.html" title="Chapter 13. Schema" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 14. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 15. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 16. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 17. Data Import" /><link rel="chapter" href="graph-algo.html" title="Chapter 18. Graph Algorithms" /><link rel="chapter" href="rest-api.html" title="Chapter 19. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 20. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 21. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 22. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 23. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 24. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 25. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 26. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 27. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 28. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 29. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 30. Contributing to Neo4j" /><link rel="part" href="advanced-usage.html" title="Part VIII. Advanced Usage" /><link rel="chapter" href="server-extending.html" title="Chapter 31. Extending the Neo4j Server" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 32. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 33. The Traversal Framework" /><link rel="chapter" href="indexing.html" title="Chapter 34. Legacy Indexing" /><link rel="chapter" href="batchinsert.html" title="Chapter 35. Batch Insertion" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-installer" /><link rel="refentry" href="re03.html" title="neo4j-shell" /><link rel="refentry" href="re04.html" title="neo4j-backup" /><link rel="refentry" href="re05.html" title="neo4j-arbiter" /><link rel="copyright" href="ln-idp218960.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="tutorials.html">Tutorials</a></span> &gt; <span class="breadcrumb-link"><a href="tutorials-cypher.html">Getting started with Cypher</a></span> &gt; <span class="breadcrumb-node">Movie Database</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="cypherdoc-create-nodes-and-relationships.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="cypherdoc-social-movie-database.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="cypherdoc-movie-database"></a>4.2. Movie Database</h2></div></div></div><p>Our example graph consists of movies with title and year and actors with a name.
Actors have <code class="literal">ACTS_IN</code> relationships to movies, which represents the role they played.
This relationship also has a role attribute.</p><p>We’ll go with three movies and three actors:</p><pre class="programlisting brush: cypher">CREATE (matrix1:Movie { title : 'The Matrix', year : '1999-03-31' })
CREATE (matrix2:Movie { title : 'The Matrix Reloaded', year : '2003-05-07' })
CREATE (matrix3:Movie { title : 'The Matrix Revolutions', year : '2003-10-27' })
CREATE (keanu:Actor { name:'Keanu Reeves' })
CREATE (laurence:Actor { name:'Laurence Fishburne' })
CREATE (carrieanne:Actor { name:'Carrie-Anne Moss' })
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix1)
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix2)
CREATE (keanu)-[:ACTS_IN { role : 'Neo' }]-&gt;(matrix3)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix1)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix2)
CREATE (laurence)-[:ACTS_IN { role : 'Morpheus' }]-&gt;(matrix3)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix1)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix2)
CREATE (carrieanne)-[:ACTS_IN { role : 'Trinity' }]-&gt;(matrix3)</pre><p>This gives us the following graph to play with:</p><div class="informalfigure"><a class="ulink" href="images/cypherdoc--3b7c1848.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypherdoc--3b7c1848.svg" alt="cypherdoc--3b7c1848.svg" /></span>
</a></div><p class="cypherdoc-console"></p><p>Let’s check how many nodes we have now:</p><pre class="programlisting brush: cypher">MATCH (n)
RETURN "Hello Graph with " + count(*)+ " Nodes!" AS welcome;</pre><p>Return a single node, by name:</p><pre class="programlisting brush: cypher">MATCH (movie:Movie { title: 'The Matrix' })
RETURN movie;</pre><p>Return the title and date of the matrix node:</p><pre class="programlisting brush: cypher">MATCH (movie:Movie { title: 'The Matrix' })
RETURN movie.title, movie.year;</pre><p>Which results in:</p><div class="queryresult table"><table cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">movie.title</th><th align="left" valign="top">movie.year</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">"The Matrix"</code></p></td><td align="left" valign="top"><p><code class="literal">"1999-03-31"</code></p></td></tr></tbody></table></div><p>Show all actors:</p><pre class="programlisting brush: cypher">MATCH (actor:Actor)
RETURN actor;</pre><p>Return just the name, and order them by name:</p><pre class="programlisting brush: cypher">MATCH (actor:Actor)
RETURN actor.name
ORDER BY actor.name;</pre><p>Count the actors:</p><pre class="programlisting brush: cypher">MATCH (actor:Actor)
RETURN count(*);</pre><p>Get only the actors whose names end with “s”:</p><pre class="programlisting brush: cypher">MATCH (actor:Actor)
WHERE actor.name =~ ".*s$"
RETURN actor.name;</pre><p>Here’s some exploratory queries for unknown datasets.
<span class="emphasis"><em>Don’t do this on live production databases!</em></span></p><p>Count nodes:</p><pre class="programlisting brush: cypher">MATCH (n)
RETURN count(*);</pre><p>Count relationship types:</p><pre class="programlisting brush: cypher">MATCH (n)-[r]-&gt;()
RETURN type(r), count(*);</pre><div class="queryresult table"><table cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">type(r)</th><th align="left" valign="top">count(*)</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">"ACTS_IN"</code></p></td><td align="left" valign="top"><p><code class="literal">9</code></p></td></tr></tbody></table></div><p>List all nodes and their relationships:</p><pre class="programlisting brush: cypher">MATCH (n)-[r]-&gt;(m)
RETURN n AS from, r AS `-&gt;`, m AS to;</pre><div class="queryresult table"><table cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /><col class="col3" /></colgroup><thead><tr><th align="left" valign="top">from</th><th align="left" valign="top">-&gt;</th><th align="left" valign="top">to</th></tr></thead><tfoot><tr><th colspan="3" align="left" valign="top">9 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Keanu Reeves"}</code></p></td><td align="left" valign="top"><p><code class="literal">:ACTS_IN[0]{role:"Neo"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[0]{title:"The Matrix",year:"1999-03-31"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Keanu Reeves"}</code></p></td><td align="left" valign="top"><p><code class="literal">:ACTS_IN[1]{role:"Neo"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Keanu Reeves"}</code></p></td><td align="left" valign="top"><p><code class="literal">:ACTS_IN[2]{role:"Neo"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Laurence Fishburne"}</code></p></td><td align="left" valign="top"><p><code class="literal">:ACTS_IN[3]{role:"Morpheus"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[0]{title:"The Matrix",year:"1999-03-31"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Laurence Fishburne"}</code></p></td><td align="left" valign="top"><p><code class="literal">:ACTS_IN[4]{role:"Morpheus"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Laurence Fishburne"}</code></p></td><td align="left" valign="top"><p><code class="literal">:ACTS_IN[5]{role:"Morpheus"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"Carrie-Anne Moss"}</code></p></td><td align="left" valign="top"><p><code class="literal">:ACTS_IN[6]{role:"Trinity"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[0]{title:"The Matrix",year:"1999-03-31"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"Carrie-Anne Moss"}</code></p></td><td align="left" valign="top"><p><code class="literal">:ACTS_IN[7]{role:"Trinity"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[1]{title:"The Matrix Reloaded",year:"2003-05-07"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"Carrie-Anne Moss"}</code></p></td><td align="left" valign="top"><p><code class="literal">:ACTS_IN[8]{role:"Trinity"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{title:"The Matrix Revolutions",year:"2003-10-27"}</code></p></td></tr></tbody></table></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp218960.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2013 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="cypherdoc-create-nodes-and-relationships.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="tutorials-cypher.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="cypherdoc-social-movie-database.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
