<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>12.1. Predicates</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v2.0.0" /><link rel="up" href="query-function.html" title="Chapter 12. Functions" /><link rel="prev" href="query-function.html" title="Chapter 12. Functions" /><link rel="next" href="query-functions-scalar.html" title="12.2. Scalar functions" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 5. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 6. Languages" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 7. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 8. Syntax" /><link rel="chapter" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="chapter" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 12. Functions" /><link rel="chapter" href="cypher-schema.html" title="Chapter 13. Schema" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 14. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 15. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 16. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 17. Data Import" /><link rel="chapter" href="graph-algo.html" title="Chapter 18. Graph Algorithms" /><link rel="chapter" href="rest-api.html" title="Chapter 19. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 20. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 21. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 22. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 23. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 24. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 25. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 26. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 27. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 28. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 29. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 30. Contributing to Neo4j" /><link rel="part" href="advanced-usage.html" title="Part VIII. Advanced Usage" /><link rel="chapter" href="server-extending.html" title="Chapter 31. Extending the Neo4j Server" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 32. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 33. The Traversal Framework" /><link rel="chapter" href="indexing.html" title="Chapter 34. Legacy Indexing" /><link rel="chapter" href="batchinsert.html" title="Chapter 35. Batch Insertion" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-installer" /><link rel="refentry" href="re03.html" title="neo4j-shell" /><link rel="refentry" href="re04.html" title="neo4j-backup" /><link rel="refentry" href="re05.html" title="neo4j-arbiter" /><link rel="subsection" href="query-predicates.html#functions-all" title="12.1.1. ALL" /><link rel="subsection" href="query-predicates.html#functions-any" title="12.1.2. ANY" /><link rel="subsection" href="query-predicates.html#functions-none" title="12.1.3. NONE" /><link rel="subsection" href="query-predicates.html#functions-single" title="12.1.4. SINGLE" /><link rel="copyright" href="ln-idp218960.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="cypher-query-lang.html">Cypher Query Language</a></span> &gt; <span class="breadcrumb-link"><a href="query-function.html">Functions</a></span> &gt; <span class="breadcrumb-node">Predicates</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="query-function.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="query-functions-scalar.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="query-predicates"></a>12.1. Predicates</h2></div></div></div><div class="toc"><dl><dt><span class="section"><a href="query-predicates.html#functions-all">12.1.1. ALL</a></span></dt><dt><span class="section"><a href="query-predicates.html#functions-any">12.1.2. ANY</a></span></dt><dt><span class="section"><a href="query-predicates.html#functions-none">12.1.3. NONE</a></span></dt><dt><span class="section"><a href="query-predicates.html#functions-single">12.1.4. SINGLE</a></span></dt></dl></div><p>Predicates are boolean functions that return true or false for a given set of input.
They are most commonly used to filter out subgraphs in the <code class="literal">WHERE</code> part of a query.</p><p>See also <a class="xref" href="query-operators.html#query-operators-comparison" title="8.1.2. Comparison operators">Section 8.1.2, “Comparison operators”</a>.</p><div class="figure"><a id="idp10654736"></a><p class="title"><strong>Figure 12.1. Graph</strong></p><div class="figure-contents"><a class="ulink" href="images/cypher-functions-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypher-functions-graph.svg" alt="cypher-functions-graph.svg" /></span>
</a></div></div><br class="figure-break" /><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-all"></a>12.1.1. ALL</h3></div></div></div><p>Tests whether a predicate holds for all element of this collection collection.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">ALL(identifier in collection WHERE predicate)</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>collection:</em></span> An expression that returns a collection
</li><li class="listitem">
<span class="emphasis"><em>identifier:</em></span> This is the identifier that can be used from the predicate.
</li><li class="listitem">
<span class="emphasis"><em>predicate:</em></span> A predicate that is tested against all items in the collection.
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH p=(a)-[*1..3]-&gt;(b)
WHERE a.name='Alice' AND b.name='Daniel' AND ALL (x IN nodes(p) WHERE x.age &gt; 30)
RETURN p</pre><p>
</p><p>All nodes in the returned paths will have an <code class="literal">age</code> property of at least 30.</p><div class="queryresult table"><a id="idp10669856"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[Node[2]{name:"Alice",age:38,eyes:"brown"},:KNOWS[1]{},Node[4]{name:"Charlie",age:53,eyes:"green"},:KNOWS[3]{},Node[0]{name:"Daniel",age:54,eyes:"brown"}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-any"></a>12.1.2. ANY</h3></div></div></div><p>Tests whether a predicate holds for at least one element in the collection.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">ANY(identifier in collection WHERE predicate)</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>collection:</em></span> An expression that returns a collection
</li><li class="listitem">
<span class="emphasis"><em>identifier:</em></span> This is the identifier that can be used from the predicate.
</li><li class="listitem">
<span class="emphasis"><em>predicate:</em></span> A predicate that is tested against all items in the collection.
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (a)
WHERE a.name='Eskil' AND ANY (x IN a.array WHERE x = "one")
RETURN a</pre><p>
</p><p>All nodes in the returned paths has at least one <code class="literal">one</code> value set in the array property named <code class="literal">array</code>.</p><div class="queryresult table"><a id="idp10692192"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">a</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Eskil",age:41,eyes:"blue",array:["one","two","three"]}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-none"></a>12.1.3. NONE</h3></div></div></div><p>Returns true if the predicate holds for no element in the collection.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">NONE(identifier in collection WHERE predicate)</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>collection:</em></span> An expression that returns a collection
</li><li class="listitem">
<span class="emphasis"><em>identifier:</em></span> This is the identifier that can be used from the predicate.
</li><li class="listitem">
<span class="emphasis"><em>predicate:</em></span> A predicate that is tested against all items in the collection.
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH p=(n)-[*1..3]-&gt;(b)
WHERE n.name='Alice' AND NONE (x IN nodes(p) WHERE x.age = 25)
RETURN p</pre><p>
</p><p>No nodes in the returned paths has a <code class="literal">age</code> property set to <code class="literal">25</code>.</p><div class="queryresult table"><a id="idp10714320"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[Node[2]{name:"Alice",age:38,eyes:"brown"},:KNOWS[1]{},Node[4]{name:"Charlie",age:53,eyes:"green"}]</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">[Node[2]{name:"Alice",age:38,eyes:"brown"},:KNOWS[1]{},Node[4]{name:"Charlie",age:53,eyes:"green"},:KNOWS[3]{},Node[0]{name:"Daniel",age:54,eyes:"brown"}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-single"></a>12.1.4. SINGLE</h3></div></div></div><p>Returns true if the predicate holds for exactly one of the elements in the collection.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">SINGLE(identifier in collection WHERE predicate)</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>collection:</em></span> An expression that returns a collection
</li><li class="listitem">
<span class="emphasis"><em>identifier:</em></span> This is the identifier that can be used from the predicate.
</li><li class="listitem">
<span class="emphasis"><em>predicate:</em></span> A predicate that is tested against all items in the collection.
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH p=(n)--&gt;(b)
WHERE n.name='Alice' AND SINGLE (var IN nodes(p) WHERE var.eyes = "blue")
RETURN p</pre><p>
</p><p>Exactly one node in every returned path will have the <code class="literal">eyes</code> property set to <code class="literal">"blue"</code>.</p><div class="queryresult table"><a id="idp10738240"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">p</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[Node[2]{name:"Alice",age:38,eyes:"brown"},:KNOWS[0]{},Node[3]{name:"Bob",age:25,eyes:"blue"}]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp218960.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2013 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="query-function.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="query-function.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="query-functions-scalar.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
