<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>10.5. Aggregation</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v2.0.0" /><link rel="up" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="prev" href="query-start.html" title="10.4. Start" /><link rel="next" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 5. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 6. Languages" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 7. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 8. Syntax" /><link rel="chapter" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="chapter" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 12. Functions" /><link rel="chapter" href="cypher-schema.html" title="Chapter 13. Schema" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 14. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 15. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 16. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 17. Data Import" /><link rel="chapter" href="graph-algo.html" title="Chapter 18. Graph Algorithms" /><link rel="chapter" href="rest-api.html" title="Chapter 19. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 20. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 21. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 22. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 23. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 24. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 25. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 26. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 27. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 28. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 29. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 30. Contributing to Neo4j" /><link rel="part" href="advanced-usage.html" title="Part VIII. Advanced Usage" /><link rel="chapter" href="server-extending.html" title="Chapter 31. Extending the Neo4j Server" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 32. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 33. The Traversal Framework" /><link rel="chapter" href="indexing.html" title="Chapter 34. Legacy Indexing" /><link rel="chapter" href="batchinsert.html" title="Chapter 35. Batch Insertion" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-installer" /><link rel="refentry" href="re03.html" title="neo4j-shell" /><link rel="refentry" href="re04.html" title="neo4j-backup" /><link rel="refentry" href="re05.html" title="neo4j-arbiter" /><link rel="subsection" href="query-aggregation.html#aggregation-introduction" title="10.5.1. Introduction" /><link rel="subsection" href="query-aggregation.html#_count" title="10.5.2. COUNT" /><link rel="subsection" href="query-aggregation.html#_statistics" title="10.5.3. Statistics" /><link rel="subsection" href="query-aggregation.html#aggregation-collect" title="10.5.4. collect" /><link rel="subsection" href="query-aggregation.html#aggregation-distinct" title="10.5.5. DISTINCT" /><link rel="copyright" href="ln-idp218960.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="cypher-query-lang.html">Cypher Query Language</a></span> &gt; <span class="breadcrumb-link"><a href="query-read.html">Reading Clauses</a></span> &gt; <span class="breadcrumb-node">Aggregation</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="query-start.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="query-write.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="query-aggregation"></a>10.5. Aggregation</h2></div></div></div><div class="toc"><dl><dt><span class="section"><a href="query-aggregation.html#aggregation-introduction">10.5.1. Introduction</a></span></dt><dt><span class="section"><a href="query-aggregation.html#_count">10.5.2. COUNT</a></span></dt><dt><span class="section"><a href="query-aggregation.html#_statistics">10.5.3. Statistics</a></span></dt><dt><span class="section"><a href="query-aggregation.html#aggregation-collect">10.5.4. collect</a></span></dt><dt><span class="section"><a href="query-aggregation.html#aggregation-distinct">10.5.5. DISTINCT</a></span></dt></dl></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="aggregation-introduction"></a>10.5.1. Introduction</h3></div></div></div><p>To calculate aggregated data, Cypher offers aggregation, much like SQL’s <code class="literal">GROUP BY</code>.</p><p>Aggregate functions take multiple input values and calculate an aggregated value from them.
Examples are <code class="literal">avg</code> that calculates the average of multiple numeric values, or <code class="literal">min</code> that finds the smallest numeric value in a set of values.</p><p>Aggregation can be done over all the matching sub graphs, or it can be further divided by introducing key values.
These are non-aggregate expressions, that are used to group the values going into the aggregate functions.</p><p>So, if the return statement looks something like this:</p><pre class="programlisting brush: cypher">RETURN n, count(*)</pre><p>We have two return expressions — <code class="literal">n</code>, and <code class="literal">count(*)</code>.
The first, <code class="literal">n</code>, is no aggregate function, and so it will be the grouping key.
The latter, <code class="literal">count(*)</code> is an aggregate expression.
So the matching subgraphs will be divided into different buckets, depending on the grouping key.
The aggregate function will then run on these buckets, calculating the aggregate values.</p><p>If you want to use aggregations to sort your result set, the aggregation must be included in the <code class="literal">RETURN</code> to be used in your <code class="literal">ORDER BY</code>.</p><p>The last piece of the puzzle is the <code class="literal">DISTINCT</code> keyword.
It is used to make all values unique before running them through an aggregate function.</p><p>An example might be helpful.
In this case, we are running the query against the following data:</p><div class="informalfigure"><a class="ulink" href="images/aggregation-introduction.preparation-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/aggregation-introduction.preparation-graph.svg" alt="aggregation-introduction.preparation-graph.svg" /></span>
</a></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (me:Person)--&gt;(friend:Person)--&gt;(friend_of_friend:Person)
WHERE me.name = 'A'
RETURN count(DISTINCT friend_of_friend), count(friend_of_friend)</pre><p>
</p><p>In this example we are trying to find all our friends of friends, and count them.
The first aggregate function, <code class="literal">count(DISTINCT friend_of_friend)</code>, will only see a <code class="literal">friend_of_friend</code> once — <code class="literal">DISTINCT</code> removes the duplicates.
The latter aggregate function, <code class="literal">count(friend_of_friend)</code>, might very well see the same <code class="literal">friend_of_friend</code> multiple times.
In this case, both <code class="literal">B</code> and <code class="literal">C</code> know <code class="literal">D</code> and thus <code class="literal">D</code> will get counted twice, when not using <code class="literal">DISTINCT</code>.</p><div class="queryresult table"><a id="idp9591792"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">count(distinct friend_of_friend)</th><th align="left" valign="top">count(friend_of_friend)</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">1</code></p></td><td align="left" valign="top"><p><code class="literal">2</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /><p>The following examples are assuming the example graph structure below.</p><div class="figure"><a id="idp9604416"></a><p class="title"><strong>Figure 10.5. Graph</strong></p><div class="figure-contents"><a class="ulink" href="images/cypher-aggregation-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypher-aggregation-graph.svg" alt="cypher-aggregation-graph.svg" /></span>
</a></div></div><br class="figure-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="_count"></a>10.5.2. COUNT</h3></div></div></div><p><code class="literal">COUNT</code> is used to count the number of rows.
<code class="literal">COUNT</code> can be used in two forms — <code class="literal">COUNT(*)</code> which just counts the number of matching rows, and <code class="literal">COUNT(&lt;identifier&gt;)</code>, which counts the number of non-<code class="literal">NULL</code> values in <code class="literal">&lt;identifier&gt;</code>.</p><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-count-nodes"></a>Count nodes</h4></div></div></div><p>To count the number of nodes, for example the number of nodes connected to one node, you can use <code class="literal">count(*)</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n { name: 'A' })--&gt;(x)
RETURN n, count(*)</pre><p>
</p><p>This returns the start node and the count of related nodes.</p><div class="queryresult table"><a id="idp9618784"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">n</th><th align="left" valign="top">count(*)</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"A",property:13}</code></p></td><td align="left" valign="top"><p><code class="literal">3</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-group-count-relationship-types"></a>Group Count Relationship Types</h4></div></div></div><p>To count the groups of relationship types, return the types and count them with <code class="literal">count(*)</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n { name: 'A' })-[r]-&gt;()
RETURN type(r), count(*)</pre><p>
</p><p>The relationship types and their group count is returned by the query.</p><div class="queryresult table"><a id="idp9635776"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">type(r)</th><th align="left" valign="top">count(*)</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">"KNOWS"</code></p></td><td align="left" valign="top"><p><code class="literal">3</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-count-entities"></a>Count entities</h4></div></div></div><p>Instead of counting the number of results with <code class="literal">count(*)</code>, it might be more expressive to include the name of the identifier you care about.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n { name: 'A' })--&gt;(x)
RETURN count(x)</pre><p>
</p><p>The example query returns the number of connected nodes from the start node.</p><div class="queryresult table"><a id="idp9652784"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">count(x)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">3</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-count-non-null-values"></a>Count non-null values</h4></div></div></div><p>You can count the non-<code class="literal">null</code> values by using <code class="literal">count(&lt;identifier&gt;)</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n:Person)
RETURN count(n.property)</pre><p>
</p><p>The count of related nodes with the <code class="literal">property</code> property set is returned by the query.</p><div class="queryresult table"><a id="idp9668560"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">count(n.property)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">3</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="_statistics"></a>10.5.3. Statistics</h3></div></div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-sum"></a>sum</h4></div></div></div><p>The <code class="literal">sum</code> aggregation function simply sums all the numeric values it encounters. <code class="literal">NULL</code>s are silently dropped.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n:Person)
RETURN sum(n.property)</pre><p>
</p><p>This returns the sum of all the values in the property <code class="literal">property</code>.</p><div class="queryresult table"><a id="idp9685488"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">sum(n.property)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">90</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-avg"></a>avg</h4></div></div></div><p><code class="literal">avg</code> calculates the average of a numeric column.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n:Person)
RETURN avg(n.property)</pre><p>
</p><p>The average of all the values in the property <code class="literal">property</code> is returned by the example query.</p><div class="queryresult table"><a id="idp9700384"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">avg(n.property)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">30.0</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-percentiledisc"></a>percentileDisc</h4></div></div></div><p><code class="literal">percentileDisc</code> calculates the percentile of a given value over a group, with a percentile from 0.0 to 1.0.
It uses a rounding method, returning the nearest value to the percentile.
For interpolated values, see <code class="literal">percentileCont</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n:Person)
RETURN percentileDisc(n.property, 0.5)</pre><p>
</p><p>The 50th percentile of the values in the property <code class="literal">property</code> is returned by the example query. In this case, 0.5 is the median, or 50th percentile.</p><div class="queryresult table"><a id="idp9716464"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">percentileDisc(n.property, 0.5)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">33</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-percentilecont"></a>percentileCont</h4></div></div></div><p><code class="literal">percentileCont</code> calculates the percentile of a given value over a group, with a percentile from 0.0 to 1.0.
It uses a linear interpolation method, calculating a weighted average between two values, if the desired percentile lies between them.
For nearest values using a rounding method, see <code class="literal">percentileDisc</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n:Person)
RETURN percentileCont(n.property, 0.4)</pre><p>
</p><p>The 40th percentile of the values in the property <code class="literal">property</code> is returned by the example query, calculated with a weighted average.</p><div class="queryresult table"><a id="idp9732688"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">percentileCont(n.property, 0.4)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">29.0</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-stdev"></a>stdev</h4></div></div></div><p><code class="literal">stdev</code> calculates the standard deviation for a given value over a group.
It uses a standard two-pass method, with <code class="literal">N - 1</code> as the denominator, and should be used when taking a sample of the population for an unbiased estimate.
When the standard variation of the entire population is being calculated, <code class="literal">stdevp</code> should be used.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE n.name IN ['A', 'B', 'C']
RETURN stdev(n.property)</pre><p>
</p><p>The standard deviation of the values in the property <code class="literal">property</code> is returned by the example query.</p><div class="queryresult table"><a id="idp9749552"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">stdev(n.property)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">15.716233645501712</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-stdevp"></a>stdevp</h4></div></div></div><p><code class="literal">stdevp</code> calculates the standard deviation for a given value over a group.
It uses a standard two-pass method, with <code class="literal">N</code> as the denominator, and should be used when calculating the standard deviation for an entire population.
When the standard variation of only a sample of the population is being calculated, <code class="literal">stdev</code> should be used.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE n.name IN ['A', 'B', 'C']
RETURN stdevp(n.property)</pre><p>
</p><p>The population standard deviation of the values in the property <code class="literal">property</code> is returned by the example query.</p><div class="queryresult table"><a id="idp9766576"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">stdevp(n.property)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">12.832251036613439</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-max"></a>max</h4></div></div></div><p><code class="literal">max</code> find the largest value in a numeric column.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n:Person)
RETURN max(n.property)</pre><p>
</p><p>The largest of all the values in the property <code class="literal">property</code> is returned.</p><div class="queryresult table"><a id="idp9781488"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">max(n.property)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">44</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="aggregation-min"></a>min</h4></div></div></div><p><code class="literal">min</code> takes a numeric property as input, and returns the smallest value in that column.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n:Person)
RETURN min(n.property)</pre><p>
</p><p>This returns the smallest of all the values in the property <code class="literal">property</code>.</p><div class="queryresult table"><a id="idp9796320"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">min(n.property)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">13</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="aggregation-collect"></a>10.5.4. collect</h3></div></div></div><p><code class="literal">collect</code> collects all the values into a list. It will ignore <code class="literal">NULL</code>s.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n:Person)
RETURN collect(n.property)</pre><p>
</p><p>Returns a single row, with all the values collected.</p><div class="queryresult table"><a id="idp9811408"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">collect(n.property)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">[13,33,44]</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="aggregation-distinct"></a>10.5.5. DISTINCT</h3></div></div></div><p>All aggregation functions also take the <code class="literal">DISTINCT</code> modifier, which removes duplicates from the values.
So, to count the number of unique eye colors from nodes related to <code class="literal">a</code>, this query can be used:</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (a:Person { name: 'A' })--&gt;(b)
RETURN count(DISTINCT b.eyes)</pre><p>
</p><p>Returns the number of eye colors.</p><div class="queryresult table"><a id="idp9826656"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">count(distinct b.eyes)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">2</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp218960.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2013 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="query-start.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="query-read.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="query-write.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
