<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>10.3. Where</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v2.0.0" /><link rel="up" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="prev" href="query-optional-match.html" title="10.2. Optional Match" /><link rel="next" href="query-start.html" title="10.4. Start" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 5. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 6. Languages" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 7. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 8. Syntax" /><link rel="chapter" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="chapter" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 12. Functions" /><link rel="chapter" href="cypher-schema.html" title="Chapter 13. Schema" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 14. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 15. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 16. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 17. Data Import" /><link rel="chapter" href="graph-algo.html" title="Chapter 18. Graph Algorithms" /><link rel="chapter" href="rest-api.html" title="Chapter 19. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 20. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 21. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 22. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 23. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 24. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 25. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 26. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 27. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 28. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 29. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 30. Contributing to Neo4j" /><link rel="part" href="advanced-usage.html" title="Part VIII. Advanced Usage" /><link rel="chapter" href="server-extending.html" title="Chapter 31. Extending the Neo4j Server" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 32. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 33. The Traversal Framework" /><link rel="chapter" href="indexing.html" title="Chapter 34. Legacy Indexing" /><link rel="chapter" href="batchinsert.html" title="Chapter 35. Batch Insertion" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-installer" /><link rel="refentry" href="re03.html" title="neo4j-shell" /><link rel="refentry" href="re04.html" title="neo4j-backup" /><link rel="refentry" href="re05.html" title="neo4j-arbiter" /><link rel="subsection" href="query-where.html#_basic_usage" title="10.3.1. Basic usage" /><link rel="subsection" href="query-where.html#_regular_expressions" title="10.3.2. Regular expressions" /><link rel="subsection" href="query-where.html#query-where-patterns" title="10.3.3. Using patterns in WHERE" /><link rel="subsection" href="query-where.html#_collections" title="10.3.4. Collections" /><link rel="subsection" href="query-where.html#_missing_properties_and_values" title="10.3.5. Missing properties and values" /><link rel="copyright" href="ln-idp218960.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="cypher-query-lang.html">Cypher Query Language</a></span> &gt; <span class="breadcrumb-link"><a href="query-read.html">Reading Clauses</a></span> &gt; <span class="breadcrumb-node">Where</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="query-optional-match.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="query-start.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="query-where"></a>10.3. Where</h2></div></div></div><div class="toc"><dl><dt><span class="section"><a href="query-where.html#_basic_usage">10.3.1. Basic usage</a></span></dt><dt><span class="section"><a href="query-where.html#_regular_expressions">10.3.2. Regular expressions</a></span></dt><dt><span class="section"><a href="query-where.html#query-where-patterns">10.3.3. Using patterns in WHERE</a></span></dt><dt><span class="section"><a href="query-where.html#_collections">10.3.4. Collections</a></span></dt><dt><span class="section"><a href="query-where.html#_missing_properties_and_values">10.3.5. Missing properties and values</a></span></dt></dl></div><p><code class="literal">WHERE</code> is not a clause in it’s own right — rather, it’s part of <code class="literal">MATCH</code>, <code class="literal">OPTIONAL</code> <code class="literal">MATCH</code>, <code class="literal">START</code> and <code class="literal">WITH</code>.</p><p>In the case of <code class="literal">WITH</code> and <code class="literal">START</code>, <code class="literal">WHERE</code> simply filters the results.</p><p>For <code class="literal">MATCH</code> and <code class="literal">OPTIONAL</code> <code class="literal">MATCH</code> on the other hand, <code class="literal">WHERE</code> adds constraints to the patterns described.
It should not be seen as a filter after the matching is finished.</p><div class="note" style="margin-left: 0; margin-right: 10%;"><table border="0" summary="Note"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Note]" src="images/icons/admon/note.png" /></td><th align="left">Note</th></tr><tr><td align="left" valign="top"><p>In the case of multiple (<code class="literal">OPTIONAL</code>) <code class="literal">MATCH</code> clauses, the predicate in <code class="literal">WHERE</code> is always a part of the patterns in the directly preceding <code class="literal">MATCH</code>.
Both results and performance may be impacted if the <code class="literal">WHERE</code> is put inside the wrong <code class="literal">MATCH</code> clause.</p></td></tr></table></div><div class="figure"><a id="idp9168208"></a><p class="title"><strong>Figure 10.3. Graph</strong></p><div class="figure-contents"><a class="ulink" href="images/cypher-where-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypher-where-graph.svg" alt="cypher-where-graph.svg" /></span>
</a></div></div><br class="figure-break" /><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="_basic_usage"></a>10.3.1. Basic usage</h3></div></div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-boolean-operations"></a>Boolean operations</h4></div></div></div><p>You can use the expected boolean operators <code class="literal">AND</code> and <code class="literal">OR</code>, and also the boolean function <code class="literal">NOT</code>. See <a class="xref" href="cypher-working-with-null.html" title="8.7. Working with NULL">Section 8.7, “Working with NULL”</a> for more information on how this works with <code class="literal">NULL</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE n.name = 'Peter' XOR (n.age &lt; 30 AND n.name = "Tobias") OR NOT (n.name = "Tobias" OR
  n.name="Peter")
RETURN n</pre><p>
</p><p>This query shows how boolean operators can be used.</p><div class="queryresult table"><a id="idp9180784"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[0]{name:"Tobias",age:25}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Peter",age:34}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Andres",age:36,belt:"white"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-filter-on-node-label"></a>Filter on node label</h4></div></div></div><p>To filter nodes by label, write a label predicate after the <code class="literal">WHERE</code> keyword using <code class="literal">WHERE n:foo</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE n:Swedish
RETURN n</pre><p>
</p><p>The "<code class="literal">Andres</code>" node will be returned.</p><div class="queryresult table"><a id="idp9199584"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Andres",age:36,belt:"white"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-filter-on-node-property"></a>Filter on node property</h4></div></div></div><p>To filter on a property, write your clause after the <code class="literal">WHERE</code> keyword. Filtering on relationship properties works just the same way.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE n.age &lt; 30
RETURN n</pre><p>
</p><p>The "<code class="literal">Tobias</code>" node will be returned.</p><div class="queryresult table"><a id="idp9214496"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[0]{name:"Tobias",age:25}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-property-exists"></a>Property exists</h4></div></div></div><p>To only include nodes/relationships that have a property, use the <code class="literal">HAS()</code> function and just write out the identifier and the property you expect it to have.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE HAS (n.belt)
RETURN n</pre><p>
</p><p>The node named "<code class="literal">Andres</code>" is returned.</p><div class="queryresult table"><a id="idp9229424"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Andres",age:36,belt:"white"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="_regular_expressions"></a>10.3.2. Regular expressions</h3></div></div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-regular-expressions"></a>Regular expressions</h4></div></div></div><p>You can match on regular expressions by using <code class="literal">=~ "regexp"</code>, like this:</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE n.name =~ 'Tob.*'
RETURN n</pre><p>
</p><p>The "<code class="literal">Tobias</code>" node will be returned.</p><div class="queryresult table"><a id="idp9245536"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[0]{name:"Tobias",age:25}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-escaping-in-regular-expressions"></a>Escaping in regular expressions</h4></div></div></div><p>If you need a forward slash inside of your regular expression, escape it. Remember that back slash needs to be escaped in string literals</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE n.name =~ 'Some\/thing'
RETURN n</pre><p>
</p><p>No nodes match this regular expression.</p><div class="queryresult table"><a id="idp9259056"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">0 row</th></tr></tfoot><tbody><tr><td class="emptyresult" align="left" valign="top"><p><code class="literal">(empty result)</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-case-insensitive-regular-expressions"></a>Case insensitive regular expressions</h4></div></div></div><p>By pre-pending a regular expression with <code class="literal">(?i)</code>, the whole expression becomes case insensitive.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE n.name =~ '(?i)ANDR.*'
RETURN n</pre><p>
</p><p>The node with name "<code class="literal">Andres</code>" is returned.</p><div class="queryresult table"><a id="idp9274880"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Andres",age:36,belt:"white"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="query-where-patterns"></a>10.3.3. Using patterns in WHERE</h3></div></div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-filter-on-patterns"></a>Filter on patterns</h4></div></div></div><p>Patterns are expressions in Cypher, expressions that return a collection of paths. Collection
expressions are also predicates — an empty collection represents <code class="literal">false</code>, and a non-empty represents <code class="literal">true</code>.</p><p>So, patterns are not only expressions, they are also predicates. The only limitation to your pattern is that you must be
able to express it in a single path. You can not use commas between multiple paths like you do in <code class="literal">MATCH</code>. You can achieve
the same effect by combining multiple patterns with <code class="literal">AND</code>.</p><p>Note that you can not introduce new identifiers here. Although it might look very similar to the <code class="literal">MATCH</code> patterns, the
<code class="literal">WHERE</code> clause is all about eliminating matched subgraphs. <code class="literal">MATCH (a)-[*]-&gt;(b)</code> is very different from <code class="literal">WHERE (a)-[*]-&gt;(b)</code>; the
first will produce a subgraph for every path it can find between <code class="literal">a</code> and <code class="literal">b</code>, and the latter will eliminate any matched
subgraphs where <code class="literal">a</code> and <code class="literal">b</code> do not have a directed relationship chain between them.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (tobias { name: 'Tobias' }),(others)
WHERE others.name IN ['Andres', 'Peter'] AND (tobias)&lt;--(others)
RETURN others</pre><p>
</p><p>Nodes that have an outgoing relationship to the "<code class="literal">Tobias</code>" node are returned.</p><div class="queryresult table"><a id="idp9300864"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">others</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Andres",age:36,belt:"white"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-filter-on-patterns-using-not"></a>Filter on patterns using NOT</h4></div></div></div><p>The <code class="literal">NOT</code> function can be used to exclude a pattern.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (persons),(peter { name: 'Peter' })
WHERE NOT (persons)--&gt;(peter)
RETURN persons</pre><p>
</p><p>Nodes that do not have an outgoing relationship to the "<code class="literal">Peter</code>" node are returned.</p><div class="queryresult table"><a id="idp9316016"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">persons</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[0]{name:"Tobias",age:25}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Peter",age:34}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-filter-on-patterns-with-properties"></a>Filter on patterns with properties</h4></div></div></div><p>You can also add properties to your patterns:</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE (n)-[:KNOWS]-({ name:'Tobias' })
RETURN n</pre><p>
</p><p>Finds all nodes that have a <code class="literal">KNOWS</code> relationship to a node with the name <code class="literal">Tobias</code>.</p><div class="queryresult table"><a id="idp9332560"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Andres",age:36,belt:"white"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-filtering-on-relationship-type"></a>Filtering on relationship type</h4></div></div></div><p>You can put the exact relationship type in the <code class="literal">MATCH</code> pattern, but sometimes you want to be able to do more advanced filtering on the type. You can use the special property <code class="literal">TYPE</code> to compare the type with something else. In this example, the query does a regular expression comparison with the name of the relationship type.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)-[r]-&gt;()
WHERE n.name='Andres' AND type(r)=~ 'K.*'
RETURN r</pre><p>
</p><p>This returns relationships that has a type whose name starts with K.</p><div class="queryresult table"><a id="idp9347840"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:KNOWS[0]{}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">:KNOWS[1]{}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="_collections"></a>10.3.4. Collections</h3></div></div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-in-operator"></a>IN operator</h4></div></div></div><p>To check if an element exists in a collection, you can use the <code class="literal">IN</code> operator.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (a)
WHERE a.name IN ["Peter", "Tobias"]
RETURN a</pre><p>
</p><p>This query shows how to check if a property exists in a literal collection.</p><div class="queryresult table"><a id="idp9364816"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">a</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[0]{name:"Tobias",age:25}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Peter",age:34}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="_missing_properties_and_values"></a>10.3.5. Missing properties and values</h3></div></div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-default-to-false-if-property-is-missing"></a>Default to false if property is missing</h4></div></div></div><p>As missing properties evaluate to <code class="literal">NULL</code>, the comparision in the example will evaluate to <code class="literal">FALSE</code> for nodes without the <code class="literal">belt</code> property.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE n.belt = 'white'
RETURN n</pre><p>
</p><p>Only nodes with the belt property are returned.</p><div class="queryresult table"><a id="idp9383376"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Andres",age:36,belt:"white"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-default-to-true-if-property-is-missing"></a>Default to true if property is missing</h4></div></div></div><p>If you want to compare a property on a graph element, but only if it exists, you can compare the property against both the value you are looking for and <code class="literal">NULL</code>, like:</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
WHERE n.belt = 'white' OR n.belt IS NULL RETURN n
ORDER BY n.name</pre><p>
</p><p>This returns all nodes, even those without the belt property.</p><div class="queryresult table"><a id="idp9397920"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Andres",age:36,belt:"white"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Peter",age:34}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[0]{name:"Tobias",age:25}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="where-filter-on-null"></a>Filter on NULL</h4></div></div></div><p>Sometimes you might want to test if a value or an identifier is <code class="literal">NULL</code>. This is done just like SQL does it, with <code class="literal">IS NULL</code>. Also like SQL, the negative is <code class="literal">IS NOT NULL</code>, although <code class="literal">NOT(IS NULL x)</code> also works.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (person)
WHERE person.name = 'Peter' AND person.belt IS NULL RETURN person</pre><p>
</p><p>Nodes that Tobias is not connected to are returned.</p><div class="queryresult table"><a id="idp9417312"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">person</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Peter",age:34}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp218960.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2013 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="query-optional-match.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="query-read.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="query-start.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
