<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>9.2. Order by</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v2.0.0" /><link rel="up" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="prev" href="query-return.html" title="9.1. Return" /><link rel="next" href="query-limit.html" title="9.3. Limit" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 5. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 6. Languages" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 7. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 8. Syntax" /><link rel="chapter" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="chapter" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 12. Functions" /><link rel="chapter" href="cypher-schema.html" title="Chapter 13. Schema" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 14. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 15. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 16. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 17. Data Import" /><link rel="chapter" href="graph-algo.html" title="Chapter 18. Graph Algorithms" /><link rel="chapter" href="rest-api.html" title="Chapter 19. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 20. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 21. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 22. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 23. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 24. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 25. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 26. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 27. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 28. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 29. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 30. Contributing to Neo4j" /><link rel="part" href="advanced-usage.html" title="Part VIII. Advanced Usage" /><link rel="chapter" href="server-extending.html" title="Chapter 31. Extending the Neo4j Server" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 32. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 33. The Traversal Framework" /><link rel="chapter" href="indexing.html" title="Chapter 34. Legacy Indexing" /><link rel="chapter" href="batchinsert.html" title="Chapter 35. Batch Insertion" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-installer" /><link rel="refentry" href="re03.html" title="neo4j-shell" /><link rel="refentry" href="re04.html" title="neo4j-backup" /><link rel="refentry" href="re05.html" title="neo4j-arbiter" /><link rel="subsection" href="query-order.html#order-by-order-nodes-by-property" title="9.2.1. Order nodes by property" /><link rel="subsection" href="query-order.html#order-by-order-nodes-by-multiple-properties" title="9.2.2. Order nodes by multiple properties" /><link rel="subsection" href="query-order.html#order-by-order-nodes-in-descending-order" title="9.2.3. Order nodes in descending order" /><link rel="subsection" href="query-order.html#order-by-ordering-null" title="9.2.4. Ordering NULL" /><link rel="copyright" href="ln-idp218960.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="cypher-query-lang.html">Cypher Query Language</a></span> &gt; <span class="breadcrumb-link"><a href="query-general.html">General Clauses</a></span> &gt; <span class="breadcrumb-node">Order by</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="query-return.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="query-limit.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="query-order"></a>9.2. Order by</h2></div></div></div><div class="toc"><dl><dt><span class="section"><a href="query-order.html#order-by-order-nodes-by-property">9.2.1. Order nodes by property</a></span></dt><dt><span class="section"><a href="query-order.html#order-by-order-nodes-by-multiple-properties">9.2.2. Order nodes by multiple properties</a></span></dt><dt><span class="section"><a href="query-order.html#order-by-order-nodes-in-descending-order">9.2.3. Order nodes in descending order</a></span></dt><dt><span class="section"><a href="query-order.html#order-by-ordering-null">9.2.4. Ordering NULL</a></span></dt></dl></div><p>To sort the output, use the <code class="literal">ORDER BY</code> clause. Note that you can not sort on nodes or relationships,
just on properties on these.</p><div class="figure"><a id="idp8403440"></a><p class="title"><strong>Figure 9.2. Graph</strong></p><div class="figure-contents"><a class="ulink" href="images/cypher-orderby-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypher-orderby-graph.svg" alt="cypher-orderby-graph.svg" /></span>
</a></div></div><br class="figure-break" /><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="order-by-order-nodes-by-property"></a>9.2.1. Order nodes by property</h3></div></div></div><p><code class="literal">ORDER BY</code> is used to sort the output.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
RETURN n
ORDER BY n.name</pre><p>
</p><p>The nodes are returned, sorted by their name.</p><div class="queryresult table"><a id="idp8411536"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[0]{name:"A",age:34,length:170}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"B",age:34}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"C",age:32,length:185}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="order-by-order-nodes-by-multiple-properties"></a>9.2.2. Order nodes by multiple properties</h3></div></div></div><p>You can order by multiple properties by stating each identifier in the <code class="literal">ORDER BY</code> clause. Cypher will sort the result by the first identifier listed, and for equals values, go to the next property in the <code class="literal">ORDER BY</code> clause, and so on.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
RETURN n
ORDER BY n.age, n.name</pre><p>
</p><p>This returns the nodes, sorted first by their age, and then by their name.</p><div class="queryresult table"><a id="idp8429728"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"C",age:32,length:185}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[0]{name:"A",age:34,length:170}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"B",age:34}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="order-by-order-nodes-in-descending-order"></a>9.2.3. Order nodes in descending order</h3></div></div></div><p>By adding <code class="literal">DESC[ENDING]</code> after the identifier to sort on, the sort will be done in reverse order.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
RETURN n
ORDER BY n.name DESC</pre><p>
</p><p>The example returns the nodes, sorted by their name reversely.</p><div class="queryresult table"><a id="idp8447024"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"C",age:32,length:185}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"B",age:34}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[0]{name:"A",age:34,length:170}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="order-by-ordering-null"></a>9.2.4. Ordering NULL</h3></div></div></div><p>When sorting the result set, <code class="literal">NULL</code> will always come at the end of the result set for ascending sorting, and first when doing descending sort.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)
RETURN n.length, n
ORDER BY n.length</pre><p>
</p><p>The nodes are returned sorted by the length property, with a node without that property last.</p><div class="queryresult table"><a id="idp8464208"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">n.length</th><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">170</code></p></td><td align="left" valign="top"><p><code class="literal">Node[0]{name:"A",age:34,length:170}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">185</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{name:"C",age:32,length:185}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">&lt;null&gt;</code></p></td><td align="left" valign="top"><p><code class="literal">Node[1]{name:"B",age:34}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp218960.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2013 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="query-return.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="query-general.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="query-limit.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
