<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>12.2. Scalar functions</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v2.0.0" /><link rel="up" href="query-function.html" title="Chapter 12. Functions" /><link rel="prev" href="query-predicates.html" title="12.1. Predicates" /><link rel="next" href="query-functions-collection.html" title="12.3. Collection functions" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 5. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 6. Languages" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 7. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 8. Syntax" /><link rel="chapter" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="chapter" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 12. Functions" /><link rel="chapter" href="cypher-schema.html" title="Chapter 13. Schema" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 14. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 15. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 16. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 17. Data Import" /><link rel="chapter" href="graph-algo.html" title="Chapter 18. Graph Algorithms" /><link rel="chapter" href="rest-api.html" title="Chapter 19. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 20. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 21. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 22. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 23. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 24. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 25. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 26. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 27. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 28. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 29. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 30. Contributing to Neo4j" /><link rel="part" href="advanced-usage.html" title="Part VIII. Advanced Usage" /><link rel="chapter" href="server-extending.html" title="Chapter 31. Extending the Neo4j Server" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 32. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 33. The Traversal Framework" /><link rel="chapter" href="indexing.html" title="Chapter 34. Legacy Indexing" /><link rel="chapter" href="batchinsert.html" title="Chapter 35. Batch Insertion" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-installer" /><link rel="refentry" href="re03.html" title="neo4j-shell" /><link rel="refentry" href="re04.html" title="neo4j-backup" /><link rel="refentry" href="re05.html" title="neo4j-arbiter" /><link rel="subsection" href="query-functions-scalar.html#functions-length" title="12.2.1. LENGTH" /><link rel="subsection" href="query-functions-scalar.html#functions-type" title="12.2.2. TYPE" /><link rel="subsection" href="query-functions-scalar.html#functions-id" title="12.2.3. ID" /><link rel="subsection" href="query-functions-scalar.html#functions-coalesce" title="12.2.4. COALESCE" /><link rel="subsection" href="query-functions-scalar.html#functions-head" title="12.2.5. HEAD" /><link rel="subsection" href="query-functions-scalar.html#functions-last" title="12.2.6. LAST" /><link rel="subsection" href="query-functions-scalar.html#functions-timestamp" title="12.2.7. TIMESTAMP" /><link rel="subsection" href="query-functions-scalar.html#functions-startnode" title="12.2.8. STARTNODE" /><link rel="subsection" href="query-functions-scalar.html#functions-endnode" title="12.2.9. ENDNODE" /><link rel="copyright" href="ln-idp218960.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="cypher-query-lang.html">Cypher Query Language</a></span> &gt; <span class="breadcrumb-link"><a href="query-function.html">Functions</a></span> &gt; <span class="breadcrumb-node">Scalar functions</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="query-predicates.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="query-functions-collection.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="query-functions-scalar"></a>12.2. Scalar functions</h2></div></div></div><div class="toc"><dl><dt><span class="section"><a href="query-functions-scalar.html#functions-length">12.2.1. LENGTH</a></span></dt><dt><span class="section"><a href="query-functions-scalar.html#functions-type">12.2.2. TYPE</a></span></dt><dt><span class="section"><a href="query-functions-scalar.html#functions-id">12.2.3. ID</a></span></dt><dt><span class="section"><a href="query-functions-scalar.html#functions-coalesce">12.2.4. COALESCE</a></span></dt><dt><span class="section"><a href="query-functions-scalar.html#functions-head">12.2.5. HEAD</a></span></dt><dt><span class="section"><a href="query-functions-scalar.html#functions-last">12.2.6. LAST</a></span></dt><dt><span class="section"><a href="query-functions-scalar.html#functions-timestamp">12.2.7. TIMESTAMP</a></span></dt><dt><span class="section"><a href="query-functions-scalar.html#functions-startnode">12.2.8. STARTNODE</a></span></dt><dt><span class="section"><a href="query-functions-scalar.html#functions-endnode">12.2.9. ENDNODE</a></span></dt></dl></div><p>Scalar functions return a single value.</p><div class="figure"><a id="idp10749872"></a><p class="title"><strong>Figure 12.2. Graph</strong></p><div class="figure-contents"><a class="ulink" href="images/cypher-functions-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypher-functions-graph.svg" alt="cypher-functions-graph.svg" /></span>
</a></div></div><br class="figure-break" /><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-length"></a>12.2.1. LENGTH</h3></div></div></div><p>To return or filter on the length of a collection, use the <code class="literal">LENGTH()</code> function.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">LENGTH( collection )</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>collection:</em></span> An expression that returns a collection
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH p=(a)--&gt;(b)--&gt;(c)
WHERE a.name='Alice'
RETURN length(p)</pre><p>
</p><p>The length of the path <code class="literal">p</code> is returned by the query.</p><div class="queryresult table"><a id="idp10762864"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">length(p)</th></tr></thead><tfoot><tr><th align="left" valign="top">3 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">2</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">2</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">2</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-type"></a>12.2.2. TYPE</h3></div></div></div><p>Returns a string representation of the relationship type.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">TYPE( relationship )</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>relationship:</em></span> A relationship.
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n)-[r]-&gt;()
WHERE n.name='Alice'
RETURN type(r)</pre><p>
</p><p>The relationship type of <code class="literal">r</code> is returned by the query.</p><div class="queryresult table"><a id="idp10784336"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">type(r)</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">"KNOWS"</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">"KNOWS"</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-id"></a>12.2.3. ID</h3></div></div></div><p>Returns the id of the relationship or node.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">ID( property-container )</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>property-container:</em></span> A node or a relationship.
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (a)
RETURN id(a)</pre><p>
</p><p>This returns the node id for three nodes.</p><div class="queryresult table"><a id="idp10803728"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">id(a)</th></tr></thead><tfoot><tr><th align="left" valign="top">5 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">0</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">1</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">2</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">3</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">4</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-coalesce"></a>12.2.4. COALESCE</h3></div></div></div><p>Returns the first non-<code class="literal">NULL</code> value in the list of expressions passed to it.
In case all arguments are <code class="literal">NULL</code>, <code class="literal">NULL</code> will be returned.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">COALESCE( expression [, expression]* )</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>expression:</em></span> The expression that might return NULL.
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (a)
WHERE a.name='Alice'
RETURN coalesce(a.hairColor, a.eyes)</pre><p>
</p><div class="queryresult table"><a id="idp10829040"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">coalesce(a.hairColor, a.eyes)</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">"brown"</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-head"></a>12.2.5. HEAD</h3></div></div></div><p><code class="literal">HEAD</code> returns the first element in a collection.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">HEAD( expression )</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>expression:</em></span> This expression should return a collection of some kind.
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (a)
WHERE a.name='Eskil'
RETURN a.array, head(a.array)</pre><p>
</p><p>The first node in the path is returned.</p><div class="queryresult table"><a id="idp10847392"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">a.array</th><th align="left" valign="top">head(a.array)</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">["one","two","three"]</code></p></td><td align="left" valign="top"><p><code class="literal">"one"</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-last"></a>12.2.6. LAST</h3></div></div></div><p><code class="literal">LAST</code> returns the last element in a collection.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">LAST( expression )</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>expression:</em></span> This expression should return a collection of some kind.
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (a)
WHERE a.name='Eskil'
RETURN a.array, last(a.array)</pre><p>
</p><p>The last node in the path is returned.</p><div class="queryresult table"><a id="idp10868304"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">a.array</th><th align="left" valign="top">last(a.array)</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">["one","two","three"]</code></p></td><td align="left" valign="top"><p><code class="literal">"three"</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-timestamp"></a>12.2.7. TIMESTAMP</h3></div></div></div><p><code class="literal">TIMESTAMP</code> returns the difference, measured in milliseconds, between the current time and midnight, January 1, 1970 UTC. It will return the same value during the whole one query, even if the query is a long running one.</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">TIMESTAMP()</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">RETURN timestamp()</pre><p>
</p><p>The time in milliseconds is returned.</p><div class="queryresult table"><a id="idp10887632"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">timestamp()</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">1386514453776</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-startnode"></a>12.2.8. STARTNODE</h3></div></div></div><p><code class="literal">STARTNODE</code> returns the starting node of a relationship</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">STARTNODE( relationship )</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>relationship:</em></span> An expression that returns a relationship
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (x:foo)-[r]-()
RETURN startNode(r)</pre><p>
</p><div class="queryresult table"><a id="idp10905600"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">startNode(r)</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Alice",age:38,eyes:"brown"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Alice",age:38,eyes:"brown"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="functions-endnode"></a>12.2.9. ENDNODE</h3></div></div></div><p><code class="literal">ENDNODE</code> returns the end node of a relationship</p><p><span class="strong"><strong>Syntax:</strong></span> <code class="literal">ENDNODE( relationship )</code></p><p><span class="strong"><strong>Arguments:</strong></span></p><div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem">
<span class="emphasis"><em>relationship:</em></span> An expression that returns a relationship
</li></ul></div><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (x:foo)-[r]-()
RETURN endNode(r)</pre><p>
</p><div class="queryresult table"><a id="idp10925040"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">endNode(r)</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Bob",age:25,eyes:"blue"}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">Node[4]{name:"Charlie",age:53,eyes:"green"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp218960.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2013 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="query-predicates.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="query-function.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="query-functions-collection.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
