<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>11.2. Create Unique</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v2.0.0" /><link rel="up" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="prev" href="query-create.html" title="11.1. Create" /><link rel="next" href="query-merge.html" title="11.3. Merge" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 5. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 6. Languages" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 7. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 8. Syntax" /><link rel="chapter" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="chapter" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 12. Functions" /><link rel="chapter" href="cypher-schema.html" title="Chapter 13. Schema" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 14. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 15. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 16. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 17. Data Import" /><link rel="chapter" href="graph-algo.html" title="Chapter 18. Graph Algorithms" /><link rel="chapter" href="rest-api.html" title="Chapter 19. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 20. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 21. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 22. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 23. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 24. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 25. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 26. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 27. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 28. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 29. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 30. Contributing to Neo4j" /><link rel="part" href="advanced-usage.html" title="Part VIII. Advanced Usage" /><link rel="chapter" href="server-extending.html" title="Chapter 31. Extending the Neo4j Server" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 32. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 33. The Traversal Framework" /><link rel="chapter" href="indexing.html" title="Chapter 34. Legacy Indexing" /><link rel="chapter" href="batchinsert.html" title="Chapter 35. Batch Insertion" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-installer" /><link rel="refentry" href="re03.html" title="neo4j-shell" /><link rel="refentry" href="re04.html" title="neo4j-backup" /><link rel="refentry" href="re05.html" title="neo4j-arbiter" /><link rel="subsection" href="query-create-unique.html#_create_unique_nodes" title="11.2.1. Create unique nodes" /><link rel="subsection" href="query-create-unique.html#_create_unique_relationships" title="11.2.2. Create unique relationships" /><link rel="subsection" href="query-create-unique.html#create-unique-describe-complex-pattern" title="11.2.3. Describe complex pattern" /><link rel="copyright" href="ln-idp218960.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="cypher-query-lang.html">Cypher Query Language</a></span> &gt; <span class="breadcrumb-link"><a href="query-write.html">Writing Clauses</a></span> &gt; <span class="breadcrumb-node">Create Unique</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="query-create.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="query-merge.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="query-create-unique"></a>11.2. Create Unique</h2></div></div></div><div class="toc"><dl><dt><span class="section"><a href="query-create-unique.html#_create_unique_nodes">11.2.1. Create unique nodes</a></span></dt><dt><span class="section"><a href="query-create-unique.html#_create_unique_relationships">11.2.2. Create unique relationships</a></span></dt><dt><span class="section"><a href="query-create-unique.html#create-unique-describe-complex-pattern">11.2.3. Describe complex pattern</a></span></dt></dl></div><p><code class="literal">CREATE UNIQUE</code> is in the middle of <code class="literal">MATCH</code> and <code class="literal">CREATE</code> — it will match what it can, and create what is missing.
<code class="literal">CREATE UNIQUE</code> will always make the least change possible to the graph — if it can use parts of the existing graph, it will.</p><p>Another difference to <code class="literal">MATCH</code> is that <code class="literal">CREATE UNIQUE</code> assumes the pattern to be unique.
If multiple matching subgraphs are found an error will be generated.</p><div class="tip" style="margin-left: 0; margin-right: 10%;"><table border="0" summary="Tip"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Tip]" src="images/icons/admon/tip.png" /></td><th align="left">Tip</th></tr><tr><td align="left" valign="top"><p>In the <code class="literal">CREATE UNIQUE</code> clause, patterns are used a lot.
Read <a class="xref" href="introduction-pattern.html" title="8.5. Patterns">Section 8.5, “Patterns”</a> for an introduction.</p></td></tr></table></div><p>The examples start out with the following data set:</p><div class="informalfigure"><a class="ulink" href="images/cypher-createunique-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypher-createunique-graph.svg" alt="cypher-createunique-graph.svg" /></span>
</a></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="_create_unique_nodes"></a>11.2.1. Create unique nodes</h3></div></div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="create-unique-create-node-if-missing"></a>Create node if missing</h4></div></div></div><p>If the pattern described needs a node, and it can’t be matched, a new node will be created.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[:LOVES]-(someone)
RETURN someone</pre><p>
</p><p>The root node doesn’t have any <code class="literal">LOVES</code> relationships, and so a node is created, and also a relationship to that node.</p><div class="queryresult table"><a id="idp10026672"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">someone</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Nodes created: 1
</th></tr><tr><th align="left" valign="top">Relationships created: 1</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[5]{}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="create-unique-create-nodes-with-values"></a>Create nodes with values</h4></div></div></div><p>The pattern described can also contain values on the node. These are given using the following syntax: <code class="literal">prop : &lt;expression&gt;</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[:X]-(leaf { name:'D' })
RETURN leaf</pre><p>
</p><p>No node connected with the root node has the name <code class="literal">D</code>, and so a new node is created to match the pattern.</p><div class="queryresult table"><a id="idp10044592"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">leaf</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Nodes created: 1
</th></tr><tr><th align="left" valign="top">Relationships created: 1
</th></tr><tr><th align="left" valign="top">Properties set: 1</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[5]{name:"D"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="create-unique-create-labeled-node-if-missing"></a>Create labeled node if missing</h4></div></div></div><p>If the pattern described needs a labeled node and there is none with the given labels, Cypher will create a new one.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (a { name: 'A' })
CREATE UNIQUE (a)-[:KNOWS]-(c:blue)
RETURN c</pre><p>
</p><p>The A node is connected in a <code class="literal">KNOWS</code> relationship to the c node, but since C doesn’t have the <code class="literal">:blue</code> label, a new node labeled as <code class="literal">:blue</code> is created along with a <code class="literal">KNOWS</code> relationship from A to it.</p><div class="queryresult table"><a id="idp10065680"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">c</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Nodes created: 1
</th></tr><tr><th align="left" valign="top">Relationships created: 1
</th></tr><tr><th align="left" valign="top">Labels added: 1</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[5]{}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="_create_unique_relationships"></a>11.2.2. Create unique relationships</h3></div></div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="create-unique-create-relationship-if-it-is-missing"></a>Create relationship if it is missing</h4></div></div></div><p><code class="literal">CREATE UNIQUE</code> is used to describe the pattern that should be found or created.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (lft { name: 'A' }),(rgt)
WHERE rgt.name IN ['B', 'C']
CREATE UNIQUE (lft)-[r:KNOWS]-&gt;(rgt)
RETURN r</pre><p>
</p><p>The left node is matched agains the two right nodes. One relationship already exists and can be matched, and the other relationship is created before it is returned.</p><div class="queryresult table"><a id="idp10085632"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">2 rows
</th></tr><tr><th align="left" valign="top">Relationships created: 1</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:KNOWS[5]{}</code></p></td></tr><tr><td align="left" valign="top"><p><code class="literal">:KNOWS[3]{}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a id="create-unique-create-relationship-with-values"></a>Create relationship with values</h4></div></div></div><p>Relationships to be created can also be matched on values.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[r:X { since:'forever' }]-()
RETURN r</pre><p>
</p><p>In this example, we want the relationship to have a value, and since no such relationship can be found, a new node and relationship are created. Note that since we are not interested in the created node, we don’t name it.</p><div class="queryresult table"><a id="idp10102560"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">r</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Nodes created: 1
</th></tr><tr><th align="left" valign="top">Relationships created: 1
</th></tr><tr><th align="left" valign="top">Properties set: 1</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">:X[5]{since:"forever"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="create-unique-describe-complex-pattern"></a>11.2.3. Describe complex pattern</h3></div></div></div><p>The pattern described by <code class="literal">CREATE UNIQUE</code> can be separated by commas, just like in <code class="literal">MATCH</code> and <code class="literal">CREATE</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (root { name: 'root' })
CREATE UNIQUE (root)-[:FOO]-&gt;(x),(root)-[:BAR]-&gt;(x)
RETURN x</pre><p>
</p><p>This example pattern uses two paths, separated by a comma.</p><div class="queryresult table"><a id="idp10122688"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">x</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Nodes created: 1
</th></tr><tr><th align="left" valign="top">Relationships created: 2</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[5]{}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp218960.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2013 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="query-create.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="query-write.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="query-merge.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
