<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8" /><title>11.4. Set</title><link rel="stylesheet" type="text/css" href="docbook-xsl.css" /><meta name="generator" content="DocBook XSL Stylesheets V1.76.1" /><link rel="home" href="index.html" title="The Neo4j Manual v2.0.0" /><link rel="up" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="prev" href="query-merge.html" title="11.3. Merge" /><link rel="next" href="query-delete.html" title="11.5. Delete" /><link rel="preface" href="preface.html" title="Preface" /><link rel="part" href="introduction.html" title="Part I. Introduction" /><link rel="chapter" href="introduction-highlights.html" title="Chapter 1. Neo4j Highlights" /><link rel="chapter" href="graphdb-concepts.html" title="Chapter 2. Graph Database Concepts" /><link rel="chapter" href="graphdb-neo4j.html" title="Chapter 3. The Neo4j Graph Database" /><link rel="part" href="tutorials.html" title="Part II. Tutorials" /><link rel="chapter" href="tutorials-cypher.html" title="Chapter 4. Getting started with Cypher" /><link rel="chapter" href="data-modeling-examples.html" title="Chapter 5. Data Modeling Examples" /><link rel="chapter" href="languages.html" title="Chapter 6. Languages" /><link rel="part" href="cypher-query-lang.html" title="Part III. Cypher Query Language" /><link rel="chapter" href="cypher-intro.html" title="Chapter 7. Introduction" /><link rel="chapter" href="query-syntax.html" title="Chapter 8. Syntax" /><link rel="chapter" href="query-general.html" title="Chapter 9. General Clauses" /><link rel="chapter" href="query-read.html" title="Chapter 10. Reading Clauses" /><link rel="chapter" href="query-write.html" title="Chapter 11. Writing Clauses" /><link rel="chapter" href="query-function.html" title="Chapter 12. Functions" /><link rel="chapter" href="cypher-schema.html" title="Chapter 13. Schema" /><link rel="chapter" href="examples-from-sql-to-cypher.html" title="Chapter 14. From SQL to Cypher" /><link rel="part" href="reference-documentation.html" title="Part IV. Reference" /><link rel="chapter" href="capabilities.html" title="Chapter 15. Capabilities" /><link rel="chapter" href="transactions.html" title="Chapter 16. Transaction Management" /><link rel="chapter" href="import.html" title="Chapter 17. Data Import" /><link rel="chapter" href="graph-algo.html" title="Chapter 18. Graph Algorithms" /><link rel="chapter" href="rest-api.html" title="Chapter 19. REST API" /><link rel="chapter" href="deprecations.html" title="Chapter 20. Deprecations" /><link rel="part" href="operations.html" title="Part V. Operations" /><link rel="chapter" href="deployment.html" title="Chapter 21. Installation &amp; Deployment" /><link rel="chapter" href="embedded-configuration.html" title="Chapter 22. Configuration &amp; Performance" /><link rel="chapter" href="ha.html" title="Chapter 23. High Availability" /><link rel="chapter" href="operations-backup.html" title="Chapter 24. Backup" /><link rel="chapter" href="operations-security.html" title="Chapter 25. Security" /><link rel="chapter" href="operations-monitoring.html" title="Chapter 26. Monitoring" /><link rel="part" href="tools.html" title="Part VI. Tools" /><link rel="chapter" href="tools-webadmin.html" title="Chapter 27. Web Interface" /><link rel="chapter" href="shell.html" title="Chapter 28. Neo4j Shell" /><link rel="part" href="community.html" title="Part VII. Community" /><link rel="chapter" href="community-support.html" title="Chapter 29. Community Support" /><link rel="chapter" href="community-contributing.html" title="Chapter 30. Contributing to Neo4j" /><link rel="part" href="advanced-usage.html" title="Part VIII. Advanced Usage" /><link rel="chapter" href="server-extending.html" title="Chapter 31. Extending the Neo4j Server" /><link rel="chapter" href="tutorials-java-embedded.html" title="Chapter 32. Using Neo4j embedded in Java applications" /><link rel="chapter" href="tutorial-traversal.html" title="Chapter 33. The Traversal Framework" /><link rel="chapter" href="indexing.html" title="Chapter 34. Legacy Indexing" /><link rel="chapter" href="batchinsert.html" title="Chapter 35. Batch Insertion" /><link rel="appendix" href="manpages.html" title="Appendix A. Manpages" /><link rel="refentry" href="re01.html" title="neo4j" /><link rel="refentry" href="re02.html" title="neo4j-installer" /><link rel="refentry" href="re03.html" title="neo4j-shell" /><link rel="refentry" href="re04.html" title="neo4j-backup" /><link rel="refentry" href="re05.html" title="neo4j-arbiter" /><link rel="subsection" href="query-set.html#set-set-a-property" title="11.4.1. Set a property" /><link rel="subsection" href="query-set.html#set-remove-a-property" title="11.4.2. Remove a property" /><link rel="subsection" href="query-set.html#set-copying-properties-between-nodes-and-relationships" title="11.4.3. Copying properties between nodes and relationships" /><link rel="subsection" href="query-set.html#set-set-a-property-using-a-parameter" title="11.4.4. Set a property using a parameter" /><link rel="subsection" href="query-set.html#set-set-all-properties-using-a-parameter" title="11.4.5. Set all properties using a parameter" /><link rel="subsection" href="query-set.html#set-set-a-label-on-a-node" title="11.4.6. Set a label on a node" /><link rel="subsection" href="query-set.html#set-set-multiple-labels-on-a-node" title="11.4.7. Set multiple labels on a node" /><link rel="copyright" href="ln-idp218960.html" title="License: Creative Commons 3.0" />


<!-- favicon -->

<link rel="shortcut icon" href="http://neo4j.org/favicon.ico" type="image/vnd.microsoft.icon" />
<link rel="icon" href="http://neo4j.org/favicon.ico" type="image/x-icon" />

<!-- style -->

<link href="css/shCore.css" rel="stylesheet" type="text/css" />
<link href="css/shCoreEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/shThemeEclipse.css" rel="stylesheet" type="text/css" />
<link href="css/neo.css" rel="stylesheet" type="text/css" />

<!-- Syntax Highlighter -->

<script type="text/javascript" src="js/shCore.js"></script>
<script type="text/javascript" src="js/shBrushJava.js"></script>
<script type="text/javascript" src="js/shBrushJScript.js"></script>
<script type="text/javascript" src="js/shBrushBash.js"></script>
<script type="text/javascript" src="js/shBrushPlain.js"></script>
<script type="text/javascript" src="js/shBrushXml.js"></script>
<script type="text/javascript" src="js/shBrushGroovy.js"></script>
<script type="text/javascript" src="js/shBrushCypher.js"></script>
<script type="text/javascript" src="js/shBrushScala.js"></script>
<script type="text/javascript" src="js/shBrushSql.js"></script>
<script type="text/javascript" src="js/shBrushPython.js"></script>
<script type="text/javascript" src="js/shBrushProperties.js"></script>

<!-- activate when needed
<script type="text/javascript" src="js/shBrushRuby.js"></script>
<script type="text/javascript" src="js/shBrushCSharp.js"></script>
-->
 
<script type="text/javascript">
  SyntaxHighlighter.defaults['tab-size'] = 4;
  SyntaxHighlighter.defaults['gutter'] = false;
  SyntaxHighlighter.defaults['toolbar'] = false;
  SyntaxHighlighter.all()
</script>

<!-- JQuery -->

<script type="text/javascript" src="js/jquery-1.6.4.min.js"></script>

<!-- Replace SVG for browsers that lack support. -->
<script type="text/javascript" src="js/svgreplacer.js"></script>

<!-- Image Scaler -->

<script type="text/javascript" src="js/imagescaler.js"></script>

<!-- Table Styler -->

<script type="text/javascript" src="js/tablestyler.js"></script>

<!-- Version -->

<script type="text/javascript" src="js/version.js"></script>

<!-- Offline Sidebar -->

<script type="text/javascript" src="js/sidebar.js"></script>


<div xmlns="" class="breadcrumbs"><span class="breadcrumb-link"><a href="index.html">The Neo4j Manual</a></span> &gt; <span class="breadcrumb-link"><a href="cypher-query-lang.html">Cypher Query Language</a></span> &gt; <span class="breadcrumb-link"><a href="query-write.html">Writing Clauses</a></span> &gt; <span class="breadcrumb-node">Set</span></div></head><body><div class="navheader"><table width="100%" summary="Navigation header"><tr><td width="20%" align="left"><a accesskey="p" href="query-merge.html">Prev</a> </td><th width="60%" align="center"> </th><td width="20%" align="right"> <a accesskey="n" href="query-delete.html">Next</a></td></tr></table><hr /></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a id="query-set"></a>11.4. Set</h2></div></div></div><div class="toc"><dl><dt><span class="section"><a href="query-set.html#set-set-a-property">11.4.1. Set a property</a></span></dt><dt><span class="section"><a href="query-set.html#set-remove-a-property">11.4.2. Remove a property</a></span></dt><dt><span class="section"><a href="query-set.html#set-copying-properties-between-nodes-and-relationships">11.4.3. Copying properties between nodes and relationships</a></span></dt><dt><span class="section"><a href="query-set.html#set-set-a-property-using-a-parameter">11.4.4. Set a property using a parameter</a></span></dt><dt><span class="section"><a href="query-set.html#set-set-all-properties-using-a-parameter">11.4.5. Set all properties using a parameter</a></span></dt><dt><span class="section"><a href="query-set.html#set-set-a-label-on-a-node">11.4.6. Set a label on a node</a></span></dt><dt><span class="section"><a href="query-set.html#set-set-multiple-labels-on-a-node">11.4.7. Set multiple labels on a node</a></span></dt></dl></div><p>Updating labels on nodes and properties on nodes and relationships is done with the <code class="literal">SET</code> clause.
<code class="literal">SET</code> can also be used with maps from parameters to set properties.</p><div class="note" style="margin-left: 0; margin-right: 10%;"><table border="0" summary="Note"><tr><td rowspan="2" align="center" valign="top" width="25"><img alt="[Note]" src="images/icons/admon/note.png" /></td><th align="left">Note</th></tr><tr><td align="left" valign="top"><p>Setting labels on a node is an idempotent operations — if you try to set a label on a node that already has that label on it, nothing happens.
The query statistics will tell you if something needed to be done or not.</p></td></tr></table></div><p>The examples use this graph as a starting point:</p><div class="informalfigure"><a class="ulink" href="images/cypher-set-graph.svg" target="_top">
<span class="inlinemediaobject"><img src="images/cypher-set-graph.svg" alt="cypher-set-graph.svg" /></span>
</a></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="set-set-a-property"></a>11.4.1. Set a property</h3></div></div></div><p>To set a property on a node or relationship, use <code class="literal">SET</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n { name: 'Andres' })
SET n.surname = 'Taylor'
RETURN n</pre><p>
</p><p>The newly changed node is returned by the query.</p><div class="queryresult table"><a id="idp10403792"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Properties set: 1</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Andres",age:36,awesome:true,surname:"Taylor"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="set-remove-a-property"></a>11.4.2. Remove a property</h3></div></div></div><p>Normally you remove a property by using <code class="literal"><a class="link" href="query-remove.html" title="11.6. Remove">REMOVE</a></code>, but it’s sometimes handy to do
it using the <code class="literal">SET</code> command. One example is if the property comes from a parameter.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n { name: 'Andres' })
SET n.name = NULL RETURN n</pre><p>
</p><p>The node is returned by the query, and the name property is now missing.</p><div class="queryresult table"><a id="idp10420832"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Properties set: 1</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{age:36,awesome:true}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="set-copying-properties-between-nodes-and-relationships"></a>11.4.3. Copying properties between nodes and relationships</h3></div></div></div><p>You can also use <code class="literal">SET</code> to copy all properties from one graph element to another. Remember that doing this
will remove all other properties on the receiving graph element.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (at { name: 'Andres' }),(pn { name: 'Peter' })
SET at = pn
RETURN at, pn</pre><p>
</p><p>The Andres node has had all it’s properties replaced by the properties in the Peter node.</p><div class="queryresult table"><a id="idp10437120"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /><col class="col2" /></colgroup><thead><tr><th align="left" valign="top">at</th><th align="left" valign="top">pn</th></tr></thead><tfoot><tr><th colspan="2" align="left" valign="top">1 row
</th></tr><tr><th colspan="2" align="left" valign="top">Properties set: 3</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{age:34,name:"Peter"}</code></p></td><td align="left" valign="top"><p><code class="literal">Node[2]{name:"Peter",age:34}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="set-set-a-property-using-a-parameter"></a>11.4.4. Set a property using a parameter</h3></div></div></div><p>Use a parameter to give the value of a property.</p><p><strong>Parameters. </strong>
</p><pre class="programlisting brush: javascript">{
  "surname" : "Taylor"
}</pre><p>
</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n { name: 'Andres' })
SET n.surname = { surname }
RETURN n</pre><p>
</p><p>The Andres node has got an surname added.</p><div class="queryresult table"><a id="idp10456800"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Properties set: 1</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{name:"Andres",age:36,awesome:true,surname:"Taylor"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="set-set-all-properties-using-a-parameter"></a>11.4.5. Set all properties using a parameter</h3></div></div></div><p>This will replace all existing properties on the node with the new set provided by the parameter.</p><p><strong>Parameters. </strong>
</p><pre class="programlisting brush: javascript">{
  "props" : {
    "name" : "Andres",
    "position" : "Developer"
  }
}</pre><p>
</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n { name: 'Andres' })
SET n = { props }
RETURN n</pre><p>
</p><p>The Andres node has had all it’s properties replaced by the properties in the <code class="literal">props</code> parameter.</p><div class="queryresult table"><a id="idp10472560"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Properties set: 4</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[3]{position:"Developer",name:"Andres"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="set-set-a-label-on-a-node"></a>11.4.6. Set a label on a node</h3></div></div></div><p>To set a label on a node, use <code class="literal">SET</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n { name: 'Stefan' })
SET n :German
RETURN n</pre><p>
</p><p>The newly labeled node is returned by the query.</p><div class="queryresult table"><a id="idp10485728"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Labels added: 1</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[1]{name:"Stefan"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a id="set-set-multiple-labels-on-a-node"></a>11.4.7. Set multiple labels on a node</h3></div></div></div><p>To set multiple labels on a node, use <code class="literal">SET</code> and separate the different labels using <code class="literal">:</code>.</p><p><strong>Query. </strong>
</p><pre class="programlisting brush: cypher">MATCH (n { name: 'Emil' })
SET n :Swedish:Bossman
RETURN n</pre><p>
</p><p>The newly labeled node is returned by the query.</p><div class="queryresult table"><a id="idp10502064"></a><p class="title"><strong>Result</strong></p><div class="queryresult table-contents"><table summary="Result" cellspacing="0" cellpadding="0" border="1"><colgroup><col class="col1" /></colgroup><thead><tr><th align="left" valign="top">n</th></tr></thead><tfoot><tr><th align="left" valign="top">1 row
</th></tr><tr><th align="left" valign="top">Labels added: 2</th></tr></tfoot><tbody><tr><td align="left" valign="top"><p><code class="literal">Node[0]{name:"Emil"}</code></p></td></tr></tbody></table></div></div><br class="queryresult table-break" /></div></div><HR xmlns=""></HR><a xmlns="" href="ln-idp218960.html"><p xmlns="http://www.w3.org/1999/xhtml" class="copyright">Copyright © 2013 Neo Technology</p></a><div class="navfooter"><hr /><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="query-merge.html">Prev</a> </td><td width="20%" align="center"><a accesskey="u" href="query-write.html">Up</a></td><td width="40%" align="right"> <a accesskey="n" href="query-delete.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top"> </td><td width="20%" align="center"><a accesskey="h" href="index.html">Home</a></td><td width="40%" align="right" valign="top"> </td></tr></table></div></body></html>
